//定义省、市、县（区）列表目录，采用JSON数据格式(数组中括号定义，内部嵌套大括号)编写数据源。
var provinceList = [{
		name: '北京',
		cityList: [{
			name: '市辖区',
			areaList: ['东城区', '西城区', '崇文区', '宣武区', '朝阳区', '丰台区', '石景山区', '海淀区']
		}, {
			name: '下辖县',
			areaList: ['密云县', '北京县']
		}]
	},
	{
		name: '上海',
		cityList: [{
			name: '市辖区',
			areaList: ['徐汇区', '长宁区', '静安区', '普陀区', '闸北区', '虹口区', '杨浦区', '闵行区', '嘉定区', '浦东新区', '奉贤区']
		}, {
			name: '下辖县',
			areaList: ['崇明县', '上海县']
		}]
	},
	{
		name: '湖北',
		cityList: [{
				name: '武汉市',
				areaList: ['江岸区', '汉阳区', '武昌区', '青山区', '洪山区', '东西湖区', '汉南区']
			},
			{
				name: '孝感市',
				areaList: ['孝南区', '孝昌县', '大悟县', '云梦县', '应城市', '安陆市', '汉川市']
			},
			{
				name: '荆州市',
				areaList: ['沙市区', '荆州区', '公安县', '监利县', '江陵县', '石首市', '洪湖市', '松滋市']
			},
			{
				name: '咸宁市',
				areaList: ['咸安区', '嘉鱼县', '通城县', '崇阳县', '通山县', '赤壁市']
			}
		]
	},
	{
		name: '广东',
		cityList: [{
				name: '广州市',
				areaList: ['荔湾区', '越秀区', '海珠区', '天河区', '白云区', '番禺区']
			},
			{
				name: '深圳市',
				areaList: ['罗湖区', '福田区', '南山区', '宝安区', '龙岗区', '盐田区']
			},
			{
				name: '珠海市',
				areaList: ['香洲区', '斗门区', '金湾区']
			},
			{
				name: '汕头市',
				areaList: ['龙湖区', '金平区', '濠江区', '潮阳区', '潮南区', '澄海区']
			}
		]
	}
];